from random import choices

class RockPaperScissorsUtil():
    TOO_FAST = [
        "等... 等一下啦... 你太快了... 我還要{:.2f}秒",
        "等... 等一下啦... 弄這麼快... 我還要{:.2f}秒",
        "等... 等一下啦... 太快了我會... 再給我{:.2f}秒",
        "等... 等一下啦... 這麼猴急... 我還要{:.2f}秒",
        "不要這麼急啦... 稍微等一下不行嗎...等我{:.2f}秒吧",
        "不要這麼快啦... 稍微等一下不行嗎...等我{:.2f}秒吧",
        "不要一直催啦... 稍微等一下不行嗎...等我{:.2f}秒吧",
        "不要一直出啦... 稍微等一下好嗎？...等我{:.2f}秒吧",
        "你這人怎麼... 不要這樣啦... 再給我{:.2f}秒",
        "你這人在想什麼... 不要這麼快啦... 再給我{:.2f}秒",
        "你這人怎麼... 不要這麼快啦... 再給我{:.2f}秒",
        "你這人怎麼... 老師沒教你要有耐心嗎... 再給我等{:.2f}秒!!",
        "你就這麼想再玩一次嗎? 哼... 等個{:.2f}秒再來吧",
        "你就這麼想贏嗎? 哼... 等個{:.2f}秒再來吧",
        "你就這麼想輸嗎? 哼... 等個{:.2f}秒再來吧",
        "你就這麼想玩弄我嗎? 咕... 等個{:.2f}秒再來吧",
        "咕... 這麼想跟我玩嗎... 等個{:.2f}秒再來吧",
        "我還以為是誰呢, 原來是你啊... 等我{:.2f}秒吧",
        "我還以為是怎麼了, 原來你還想玩啊... 等我{:.2f}秒吧",
        "我還以為是妮妮, 原來是你啊... 等我{:.2f}秒後我就陪你玩一場吧",
        "我還以為是你很忙呢, 原來這麼有空啊... 等我{:.2f}秒吧",
        "就算是bot也需要休息啊, 給我{:.2f}秒吧",
        "就算是bot也需要準備一下, 給我{:.2f}秒吧",
        "就算是bot也需要整理一下, 給我{:.2f}秒吧",
        "就算是bot也需要偷懶一下, 給我{:.2f}秒吧",
        "冷卻時間還需{:.2f}秒",
        "冷卻時間還剩{:.2f}秒",
        "冷卻時間所需{:.2f}秒",
        "冷卻時間剩下{:.2f}秒",
        "哎哎 同學你太快了, 稍微冷靜一下. 等個{:.2f}秒好嗎?"
    ]
    TOO_FAST_WEIGHT = [
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 40]
    def getTooFastDialog() -> str:
        return choices(population = RockPaperScissorsUtil.TOO_FAST, weights=RockPaperScissorsUtil.TOO_FAST_WEIGHT)[0]
