
KFP_DEFAULT = [
    {
        "name":"🥚雞蛋🥚",
        "color":16777215,
        "level": 0
    },
    {
        "name":"🐤小雞🐤",
        "color":16753920,
        "level": 20
    },
    {
        "name":"🐓成雞🐓",
        "color":16758016,
        "level": 40
    },
    {
        "name":"🔥火雞🔥",
        "color":16762112,
        "level": 60
    },
    {
        "name":"🍗炸雞🍗",
        "color":16766208,
        "level": 80
    },
    {
        "name":"🔶👑不死鳥👑🔶",
        "color":16774400,
        "level": 100
    }
]
