'''
店長：復甦（劍）、落燼（盾）、不死鳥羽（耳環）、PAPA的制約（封印）、死神誓約（蝴蝶結頸圈）

死神：魂歌死鐮（武器）、地獄獠牙（披風）、不眠者的榮耀（頭冠）、喚魂笛（生草笛）、不死鳥誓約（頭紗）

AME：真實之眼（放大鏡）、還原時空的懷錶（懷錶）、最強偵探的象徵（獵鹿帽+披肩外套）、（頭飾）、可以聽見心聲的黑科技產品-華生讀心器（聽診器）

INA：原始咒書（魔導書）、古神傳承（頭飾）、被召喚的觸手（觸手）、守護諭（腰間的翅膀）、五法靈結（手臂和大腿的繩結飾品）

鯊鯊：亞特蘭蒂斯王器（三叉戟）、鯊鯊帽（在陸地上買的可愛鯊鯊帽，無特殊能力）、鯊鯊裝（腰間的大嘴似乎可以探測到鮭魚）、BLOOP（鯊鯊的備用糧食）、鯊尾啦！（意圖使他人意識到自己是兇猛鯊魚的尾巴）
掛號內的東西....
在想看看有沒有能夠更簡節一點
不然就乾脆用畫的好了

'''
Kiara = [
    {
        'name' : '🗡復甦（劍）',
        'color' : 0xEE7700,
    },
    {
        'name' : '🛡落燼（盾）',
        'color' : 0xFF8800,
    },
    {
        'name' : '🪶不死鳥羽（耳環）',
        'color' : 0xFFAA33,
    },
    {
        'name' : '📜PAPA的制約（封印）',
        'color' : 0xFFBB66,
    },
    {
        'name' : '🎀死神誓約（蝴蝶結頸圈）',
        'color' : 0xFFBB66,
    }
]

Calli = [
    {
        'name' : '🎶魂歌死鐮（武器）',
        'color' : 0xFFDEDE,
    },
    {
        'name' : '❇地獄獠牙（披風）',
        'color' : 0xFFABAB,
    },
    {
        'name' : '👑不眠者的榮耀（頭冠）',
        'color' : 0xFF7878,
    },
    {
        'name' : '📏喚魂笛（生草笛）',
        'color' : 0xFF4545,
    },
    {
        'name' : '👰不死鳥誓約（頭紗）',
        'color' : 0xFF1212,
    }
]

Ame = [
    {
        'name' : '🔍真實之眼（放大鏡）',
        'color' : 0xEEEE00,
    },
    {
        'name' : '🕰還原時空的懷錶（懷錶）',
        'color' : 0xFFFF00,
    },
    {
        'name' : '💉生命維持針（針筒)',
        'color' : 0xFFFF33,
    },
    {
        'name' : '📒強者之證(兒時回憶錄)',
        'color' : 0xFFFF77,
    },
    {
        'name' : '🩺可以聽見心聲的黑科技產品-華生讀心器（聽診器）',
        'color' : 0xFFFFBB,
    }
]

Ina = [
    {
        'name' : '📖原始咒書（魔導書）',
        'color' : 0x580099,
    },
    {
        'name' : '🐙古神傳承（頭飾）',
        'color' : 0x6400B2,
    },
    {
        'name' : '👾被召喚的觸手（觸手）',
        'color' : 0x7600CC,
    },
    {
        'name' : 'ଘ( ˊωˋ )ଓ 守護諭（腰間的翅膀）',
        'color' : 0x8400E6,
    },
    {
        'name' : '💖🎀五法靈結（手臂和大腿的繩結飾品）',
        'color' : 0x990DFF,
    }
]

Mighty_Gura = [
    {
        'name' : '🔱亞特蘭蒂斯王器（三叉戟）',
        'color' : 0x067EBA,
    },
    {
        'name' : '🧢鯊鯊帽',
        'color' : 0x067EBA,
    },
    {
        'name' : '👚鯊鯊裝',
        'color' : 0x067EBA,
    },
    {
        'name' : '🥫BLOOP',
        'color' : 0x067EBA,
    },
    {
        'name' : '🦈鯊尾',
        'color' : 0x067EBA,
    }
]

EN_MEMBERS = [Kiara, Calli, Ame, Ina, Mighty_Gura]
